app/controllers/articles_controller.rb

  def show
    @article = Article.find(params[:id], :include => [:assets])
---
SELECT * FROM `articles` WHERE (`articles`.`id` = 3)
SELECT * FROM `assets` WHERE (`assets`.attachable_id = 3 AND `assets`.attachable_type = 'Article')

  def new
    @article = Article.new
    @article_types = ArticleType.all
---
SELECT * FROM `article_types`