app/controllers/documents_controller.rb

  def show
    @document = Document.find(params[:id])
---
SELECT * FROM `documents` WHERE (`documents`.`id` = 2)

  def new
    @document = Document.new
    @document_types = DocumentType.all
---
SELECT * FROM `document_types`