app/controllers/services_controller.rb

SELECT * FROM `services` WHERE (`services`.`id` = 1)
---
  def show
    @service = Service.find(params[:id])

SELECT * FROM `services` WHERE (`services`.`id` = 7)
SELECT * FROM `case_studies` WHERE (`case_studies`.service_id = 7)
SELECT * FROM `brochures` WHERE (`brochures`.service_id = 7)
---
  def edit
    @service = Service.find(params[:id])
    if @service.case_studies.blank?
      @service.case_studies.build
    end
    if @service.brochures.blank?

INSERT INTO `services` (`avatar_updated_at`, `permalink`, `updated_at`, `avatar_file_name`, `avatar_file_size`, `title`, `description`, `avatar_content_type`, `created_at`, `keywords`) VALUES('2009-06-22 17:43:21', 'physician-claim-insight', '2009-06-22 17:43:24', 'PCI.png', 15658, 'Physician Claim Insight', 'Physician Claim Insight is a prepayment fraud, abuse and overpayment prevention service designed to maximize claims payment accuracy, identify fraudulent providers and reduce professional claims costs. This service combines HCI’s cutting-edge Code Validator Pro™ (rules-based) and Fraud Finder Pro™ (profiling) software systems with claims review by RN Coding Specialists and suspect provider validation by a Clinical Investigative Unit (CIU).', 'image/png', '2009-06-22 17:43:24', 'physician fraud, medical fraud')
---
  def create
    @service = Service.new(params[:service])

    respond_to do |format|
      if @service.save

SELECT * FROM `services` WHERE (`services`.`id` = 7)
---
  def update
    @service = Service.find(params[:id])