app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`updated_at`, `crypted_password`, `username`, `password_salt`, `persistence_token`, `email`, `created_at`) VALUES('2009-06-22 14:23:33', '9c8fd5e2d02a3bfaea7987fe64ed34abbb3c2509080db9c5c22024f58942ffe7d58f19e77d6e4316634fdb42102e28e6cd298e17a6ac11e5e26a9ef385ac36d3', 'admin', 'l1kMhp5gQT4DkuIIpPOe', '3653e577124f3debef7e73ebd9c28bcd5f337725d20615219d9b52b6e35951e46c896d0b336778cd33a8644daf86338d20cae8ef54d6544f0aabd21ae0a3b53d', 'bhanson@hcinsight.com', '2009-06-22 14:23:33')